Config/Documents/УведомлениеОбИсчисленныхСуммахНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УведомлениеОбИсчисленныхСуммахНалогов</Name>
			<BasedOn>
				<xr:Item>Document.НачислениеИмущественныхНалогов</xr:Item>
				<xr:Item>Document.ОтражениеЗарплатыВУчете</xr:Item>
				<xr:Item>Document.СведенияОбУдержанномНДФЛ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеИмущественныхНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.СведенияОбУдержанномНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВыгружатьСОшибками</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уведомление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОСпецрежимахНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРедактированиеУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНалогаИлиПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогСборПлатеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалогиИПлатежиОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПоОКТМО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодБК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/РегистрацииВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РегистрацииВНалоговомОргане</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность налогоплательщика на представителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоверенностиНалогоплательщика</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиФНС</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПредставителя</Name>
					<Comment>Название документа, подтверждающего полномочия представителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Comment>Представитель в территориальном органе ФНС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УполномоченноеЛицоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подписанты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доверенность</Name>
							<Comment>Доверенность налогоплательщика на представителя</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоверенностиНалогоплательщика</v8:Type>
								<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиФНС</v8:Type>
								<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</v8:Type>
								<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УполномоченноеЛицоПредставителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПредставителя</Name>
							<Comment>Название документа, подтверждающего полномочия представителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/УведомлениеОбИсчисленныхСуммахНалогов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем Месяцы;

&НаКлиенте
Перем ФормаОтчетаПроверкиКС Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
		КонецЕсли;

		Объект.Уведомление = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьСсылку();
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПриИнициализацииФормыРегламентированногоОтчета(
		ЭтотОбъект, "ФНС");
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОтметитьКакПрочтенное(Объект.Уведомление);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов

	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Завершение отправки в контролирующий орган"
		ИЛИ ИмяСобытия = "Завершение отправки" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура")
			И Параметр.Свойство("Ссылка") 
			И Параметр.Ссылка = Объект.Уведомление
			И Не Модифицированность Тогда
		
			ЗапретитьРедактированиеДокумента();
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ПодготовитьФормуНаСервере();

	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

	ЗапретитьРедактированиеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок", Объект.Уведомление);
	СтруктураРеквизитовФормы.Вставить("Организация",     ГоловнаяОрганизация);
	
	ЗаполнитьДобавленныеКолонкиТаблицы();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// ПанельОтправкиВКонтролирующиеОрганы
	СохранитьСтатусОтправки(ЭтотОбъект, Объект.Уведомление);
	// Конец ПанельОтправкиВКонтролирующиеОрганы

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Организация", Объект.Организация);
	ПараметрыОповещения.Вставить("Период",      Объект.Дата);
	
	Оповестить("Запись_УведомлениеОбИсчисленныхСуммахНалогов", ПараметрыОповещения, Объект.Уведомление);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОрганизацияПриИзмененииНаСервере();

КонецПроцедуры

#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНаименованиеЭтапаНажатие(Элемент)
		
	Если ТолькоПросмотр Тогда
		Возврат;		
	КонецЕсли;
	
	ПараметрыИзменения = Новый Структура;
	ПараметрыИзменения.Вставить("Форма", ЭтотОбъект);
	ПараметрыИзменения.Вставить("Организация", Объект.Организация);
	ПараметрыИзменения.Вставить("КонтролирующийОрган",
		ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФНС"));
	РегламентированнаяОтчетностьКлиент.ИзменитьСтатусОтправки(ПараметрыИзменения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьСтатусОтправки(Форма, Ссылка)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Форма",          Форма);
	СтруктураПараметров.Вставить("СсылкаНаОбъект", Ссылка);
	СтруктураПараметров.Вставить("ЭтоОтчет",       Ложь);
	СтруктураПараметров.Вставить("НовСтатус",      Форма.Элементы.НаименованиеЭтапа.Заголовок);
	
	РегламентированнаяОтчетностьВызовСервера.СохранитьСтатусОтправки(СтруктураПараметров, Форма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНалоги

&НаКлиенте
Процедура НалогиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.Налоги.ТекущиеДанные;
	
	Если НоваяСтрока И Не Копирование Тогда
		ТекущиеДанные.КПП = КППОрганизации;
		ТекущиеДанные.КодПоОКТМО = КодПоОКТМО;
		ТекущиеДанные.ПредставлениеПериода =
			ПредставлениеПериодаОтчета(ТекущиеДанные.НачалоПериода, ТекущиеДанные.КонецПериода);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВидНалогаИлиПлатежаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Налоги.ТекущиеДанные;
    ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("ВидНалогаИлиПлатежа", ТекущиеДанные.ВидНалогаИлиПлатежа);
	ДанныеСтроки.Вставить("НачалоПериода", ТекущиеДанные.НачалоПериода);
	ДанныеСтроки.Вставить("КонецПериода",  ТекущиеДанные.КонецПериода);
	ДанныеСтроки.Вставить("Дата", Объект.Дата);
	
	НовыеДанныеСтроки = ДанныеСтрокиНалогиПриИзмененииВидНалогаИлиПлатежа(ДанныеСтроки); 
    ЗаполнитьЗначенияСвойств(ТекущиеДанные, НовыеДанныеСтроки);

	ТекущиеДанные.ПредставлениеПериода =
		ПредставлениеПериодаОтчета(ТекущиеДанные.НачалоПериода, ТекущиеДанные.КонецПериода);

КонецПроцедуры

&НаКлиенте
Процедура НалогиНалогСборПлатежПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Налоги.ТекущиеДанные;
    ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("НалогСборПлатеж", ТекущиеДанные.НалогСборПлатеж);
	
	НовыеДанныеСтроки = ДанныеСтрокиНалогиПриИзмененииНалогСборПлатеж(ДанныеСтроки); 
    ЗаполнитьЗначенияСвойств(ТекущиеДанные, НовыеДанныеСтроки);

КонецПроцедуры

&НаКлиенте
Процедура НалогиКППНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Объект.Организация);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.РегистрацииВНалоговомОргане.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НалогиКППОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Налоги.ТекущиеДанные;
	ТекущиеДанные.КПП = КППНалоговогоОргана(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура НалогиКодБКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"		, "Выбор кода");
	ПараметрыФормы.Вставить("Префикс"		, "СписокКодов");
	ПараметрыФормы.Вставить("ИмяМакета"		, "КодыКБК");
	ПараметрыФормы.Вставить("ТекущийПериод"	, Объект.Дата);
	ПараметрыФормы.Вставить("ТекущийКод"	, Элемент.ТекстРедактирования);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиКодБКПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Налоги.ТекущиеДанные;
	
    ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("КодБК", ТекущиеДанные.КодБК);
	ДанныеСтроки.Вставить("НачалоПериода", ТекущиеДанные.НачалоПериода);
	ДанныеСтроки.Вставить("КонецПериода",  ТекущиеДанные.КонецПериода);
	ДанныеСтроки.Вставить("Дата",  Объект.Дата);
	
	НовыеДанныеСтроки = ДанныеСтрокиНалогиПриИзмененииКодБК(ДанныеСтроки); 
    ЗаполнитьЗначенияСвойств(ТекущиеДанные, НовыеДанныеСтроки);

	ТекущиеДанные.ПредставлениеПериода =
		ПредставлениеПериодаОтчета(ТекущиеДанные.НачалоПериода, ТекущиеДанные.КонецПериода);

КонецПроцедуры

&НаКлиенте
Процедура НалогиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Налоги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Поле.Имя = "НалогиПредставлениеПериода" Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ТолькоПросмотр Тогда
			Возврат;		
		КонецЕсли;
		
		НачалоПериода = НачалоМесяца(ТекущиеДанные.НачалоПериода);
		КонецПериода  = КонецМесяца(ТекущиеДанные.КонецПериода);
		Если Не ЗначениеЗаполнено(НачалоПериода) Или Не ЗначениеЗаполнено(КонецПериода) Тогда
			НачалоПериода = НачалоМесяца(Объект.Дата);
			КонецПериода  = КонецМесяца(Объект.Дата);
		КонецЕсли;
		ИмяФормыПериода = "ВыборСтандартногоПериодаМесяц";
		ПараметрыВыбораПериода = Новый Структура("НачалоПериода, КонецПериода",
			НачалоМесяца(НачалоПериода), КонецМесяца(КонецПериода));
		Если КБКНалоговУплачиваемыхПоквартально.Найти(ТекущиеДанные.КодБК) <> Неопределено Тогда
			ИмяФормыПериода = "ВыборСтандартногоПериодаКвартал";
		ИначеЕсли КБКНалоговУплачиваемыхЕжемесячно.Найти(ТекущиеДанные.КодБК) = Неопределено Тогда
			ПараметрыВыбораПериода.Вставить("ВыборКварталов", Истина);
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборСтандартногоПериодаЗавершение", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма." + ИмяФормыПериода,
			ПараметрыВыбораПериода,
			ЭтотОбъект,
			УникальныйИдентификатор,
			,
			,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьНаДиск(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗаписатьНаДискЗавершение", ЭтотОбъект);
	ПроверитьСЗапросомДальнейшегоДействия(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрган(Команда)
	Оповещение = Новый ОписаниеОповещения("ОтправитьВКонтролирующийОрганЗавершение", ЭтотОбъект);
	ПроверитьСЗапросомДальнейшегоДействия(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузку(Команда)
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура();
	
	Если Не Объект.Проведен Или Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно провести документ.
			|Выполнить проведение документа и продолжить?'");
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьВыгрузкуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ПроверитьВыгрузкуЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернете(Команда)
	
	Если Не Объект.Проведен Или Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно провести документ.
			|Выполнить проведение документа и продолжить?'");
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьПроверитьВИнтернетеЗавершение", ЭтотОбъект);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ПроверитьПроверитьВИнтернетеЗавершение(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтрольныеСоотношения(Команда)
	
	ДополнительныеПараметры = Новый Структура();
	
	Если Не Объект.Проведен Или Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно провести документ.
			|Выполнить проведение документа и продолжить?'");
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьКонтрольныеСоотношенияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ПроверитьКонтрольныеСоотношенияЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьВыгружатьСОшибками(Команда)
	Объект.РазрешитьВыгружатьСОшибками = Не Объект.РазрешитьВыгружатьСОшибками;
	Элементы.ФормаРазрешитьВыгружатьСОшибками.Пометка = Объект.РазрешитьВыгружатьСОшибками;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеУведомления(Команда)
    Объект.РазрешитьРедактированиеУведомления = Истина;
	ТолькоПросмотр     = Ложь;
	
	ЭлементНаименованиеЭтапа = Элементы.Найти("НаименованиеЭтапа");
	Если ЭлементНаименованиеЭтапа <> Неопределено И ЭлементНаименованиеЭтапа.Заголовок = НСтр("ru = 'Сдано'") Тогда
		ЭлементНаименованиеЭтапа.Заголовок = ДокументооборотСКОКлиентСервер.СтатусСданМодифицирован();
	КонецЕсли;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ОткрытьФормуПодбора();
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьСДвухмернымШтрихкодомPDF417() Экспорт
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура();
	
	Если Не Объект.Проведен Или Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно провести документ.
			|Выполнить проведение документа и продолжить?'");
		Оповещение =
			Новый ОписаниеОповещения("ПоказатьСДвухмернымШтрихкодомPDF417Завершение", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ПоказатьСДвухмернымШтрихкодомPDF417Завершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСДвухмернымШтрихкодомPDF417Завершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Проведен Или Модифицированность Тогда
		Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Отказ               = Ложь;
	ЕстьКритичныеОшибки = Ложь;
	ТаблицаОшибок       = Новый СписокЗначений;
	
	ПроверитьНаСервере(Отказ, ЕстьКритичныеОшибки, ТаблицаОшибок);
	ДополнительныеПараметры.Вставить("ТаблицаОшибок", ТаблицаОшибок);
	
	Если ЕстьКритичныеОшибки Тогда 
		ТекстПредупреждения = НСтр("ru = 'Не заполнены обязательные поля.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если Не Отказ И ТаблицаОшибок.Количество() = 0 Тогда
		РегламентированнаяОтчетностьКлиент.ВывестиМашиночитаемуюФормуУведомленияОСпецрежимахПоСсылке(ЭтотОбъект, Объект.Уведомление);
	Иначе
		ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.НавигацияПоОшибкам",
			Новый Структура("ТаблицаОшибок", ТаблицаОшибок),
			ЭтотОбъект,
			Истина);
	КонецЕсли;
	
КонецПроцедуры

#Область РаботаСУведомлениемКакСОтчетом

&НаКлиенте
Процедура ЗаписатьНаДискЗавершение(Результат, Параметры) Экспорт
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;

	ДанныеФайла = ПолучитьДанныеФайлаНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	Если ДанныеФайла <> Неопределено Тогда
		РегламентированнаяОтчетностьКлиент.ВыгрузитьФайлы(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайлаНаСервере(ДокументСсылка, УникальныйИдентификатор)
	
	Возврат Документы.УведомлениеОбИсчисленныхСуммахНалогов.ВыгрузитьУведомлениеОбИсчисленныхСуммахНалогов(
		ДокументСсылка,
		УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрганЗавершение(Результат, Параметры) Экспорт
	Если Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;

	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиВКонтролирующийОрган(ЭтотОбъект, , , Ложь, Объект.Уведомление);
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере(Отказ = Ложь, ЕстьКритичныеОшибки = Ложь, ТаблицаОшибок, НеблокирующиеПроверки = Истина)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.ПроверитьОбязательныеПоля(ЕстьКритичныеОшибки);
	Если ЕстьКритичныеОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.ПроверитьДанныеДокумента(Отказ, НеблокирующиеПроверки);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УведомлениеОбъект = ДокументОбъект.Уведомление.ПолучитьОбъект();
	ТаблицаОшибок = УведомлениеОбъект.ПроверитьДокументСВыводомВТаблицу(УникальныйИдентификатор);
	Отказ = ТаблицаОшибок.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействия(ОповещениеЗавершения = Неопределено)
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура("ОповещениеЗавершения", ОповещениеЗавершения);
	
	Если Не Объект.Проведен Или Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно провести документ.
			|Выполнить проведение документа и продолжить?'");
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьКонтрольныеСоотношенияСЗапросомДальнейшегоДействия", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе 
		ПроверитьКонтрольныеСоотношенияСЗапросомДальнейшегоДействия(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьКонтрольныеСоотношенияСЗапросомДальнейшегоДействия(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = ДополнительныеПараметры.ОповещениеЗавершения;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СообщениеПриОтсутствииОшибок", Ложь);
	ПроверитьКонтрольныеСоотношенияЗавершение(Ответ, ДополнительныеПараметры);
	
	ДополнительныеПараметры = Новый Структура("ОповещениеЗавершения", ОповещениеЗавершения);
	
	Если ЕстьОшибкиПроверкиКонтрольныхСоотношений Тогда
		ТекстВопроса = НСтр("ru = 'При проверке контрольных соотношений обнаружены ошибки.
			|Наличие ошибок может привести к отказу в приеме уведомления.
			|Продолжить (не рекомендуется)?'");
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьСЗапросомДальнейшегоДействияПродолжение", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ПроверитьСЗапросомДальнейшегоДействияПродолжение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействияПродолжение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Проведен Или Модифицированность Тогда
		Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Отказ               = Ложь;
	ЕстьКритичныеОшибки = Ложь;
	ТаблицаОшибок       = Новый СписокЗначений;
	
	ПроверитьНаСервере(Отказ, ЕстьКритичныеОшибки, ТаблицаОшибок, Ложь);
	ДополнительныеПараметры.Вставить("ТаблицаОшибок", ТаблицаОшибок);
	
	Если ЕстьКритичныеОшибки Тогда 
		ТекстПредупреждения = НСтр("ru = 'Не заполнены обязательные поля.'");
		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		ТекстВопроса = НСтр("ru = 'В уведомлении обнаружены ошибки.
							|Продолжить (не рекомендуется)?'");
							
		Оповещение =
			Новый ОписаниеОповещения("ПроверитьСЗапросомДальнейшегоДействияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Предупреждение.'"));
	Иначе
		ПроверитьСЗапросомДальнейшегоДействияЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействияЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры.Свойство("ТаблицаОшибок") Тогда
			Если ДополнительныеПараметры.ТаблицаОшибок.Количество() > 0 Тогда
				ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.НавигацияПоОшибкам",
					Новый Структура("ТаблицаОшибок", ДополнительныеПараметры.ТаблицаОшибок),
					ЭтотОбъект,
					Истина);
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОповещениеЗавершения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Проведен Или Модифицированность Тогда
		Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Отказ               = Ложь;
	ЕстьКритичныеОшибки = Ложь;
	ТаблицаОшибок       = Новый СписокЗначений;
	
	ПроверитьНаСервере(Отказ, ЕстьКритичныеОшибки, ТаблицаОшибок, Ложь);
	ДополнительныеПараметры.Вставить("ТаблицаОшибок", ТаблицаОшибок);
	
	Если ЕстьКритичныеОшибки Тогда 
		ТекстПредупреждения = НСтр("ru = 'Не заполнены обязательные поля.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если Не Отказ И ТаблицаОшибок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибок не обнаружено");
	Иначе
		ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.НавигацияПоОшибкам",
			Новый Структура("ТаблицаОшибок", ТаблицаОшибок),
			ЭтотОбъект,
			Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПроверитьВИнтернетеЗавершение(Ответ, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Проведен Или Модифицированность Тогда
		Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПроверитьВИнтернете(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтрольныеСоотношенияЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Проведен Или Модифицированность Тогда
		Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	Если НЕ ДополнительныеПараметры.Свойство("СообщениеПриОтсутствииОшибок") Тогда
		ДополнительныеПараметры.Вставить("СообщениеПриОтсутствииОшибок", Истина);
	КонецЕсли;
	ДополнительныеПараметры.Вставить("Записать", Объект.Уведомление.Пустая());
	
	КлючУникальности = Объект.Уведомление;
	РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения_СКП(ЭтотОбъект, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьКонтрольныеСоотношенияВОтчете() Экспорт
	
	РезультатПроверки = КонтрольныеСоотношенияИсчисленныеСуммыНалогов.ПроверитьКонтрольныеСоотношенияВОтчете(ЭтотОбъект, Объект.Уведомление);
	ЕстьОшибкиПроверкиКонтрольныхСоотношений = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатПроверки, "ЧислоОшибок", 0) > 0;
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьДокументирование() Экспорт
	Возврат ВыполнитьДокументированиеНаСервере();
КонецФункции

&НаСервере
Функция ВыполнитьДокументированиеНаСервере()
	Возврат КонтрольныеСоотношенияИсчисленныеСуммыНалогов.ВыполнитьДокументированиеНаСервере(ЭтотОбъект, Объект.Уведомление);
КонецФункции

&НаКлиенте
Процедура АктивизироватьЯчейку(Ячейка) Экспорт
	
	Если Ячейка.Раздел = "СумИсчНалог_2023" Тогда
		НомерСтроки = Число(СокрЛП(СтрЗаменить(Ячейка.Страница, "Стр. ", "")));
		Для Каждого СтрокаДокумента Из Объект.Налоги Цикл
			Если НомерСтроки = СтрокаДокумента.НомерСтроки Тогда
				Элементы.Налоги.ТекущаяСтрока = СтрокаДокумента.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт 
	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ИнициализироватьРеквизитыОрганизации();
	
	КБКНалогов = Документы.УведомлениеОбИсчисленныхСуммахНалогов.КБКНалогов();
	
	КБКНалоговНДФЛ = Новый ФиксированныйМассив(
		КБКНалогов.КБКНалоговНДФЛ);

	КБКНалоговУплачиваемыхЕжемесячно = Новый ФиксированныйМассив(
		КБКНалогов.КБКНалоговУплачиваемыхЕжемесячно);
	
	КБКНалоговУплачиваемыхПоквартально = Новый ФиксированныйМассив(
		КБКНалогов.КБКНалоговУплачиваемыхПоквартально);
		
	ПредставленияКБК.Загрузить(КБКНалогов.ПредставленияКБК);	

	Элементы.ФормаРазрешитьВыгружатьСОшибками.Пометка = Объект.РазрешитьВыгружатьСОшибками;

	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок", Объект.Уведомление);
	СтруктураРеквизитовФормы.Вставить("Организация",     ГоловнаяОрганизация);
		
	ЗаполнитьДобавленныеКолонкиТаблицы();

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НалогиВидНалогаИлиПлатежа");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор, "Объект.Налоги.ВидНалогаИлиПлатежа", ,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",      Новый ПолеКомпоновкиДанных("Объект.Налоги.ПредставлениеКБК"));
	
КонецПроцедуры

&НаСервере
Процедура ЗапретитьРедактированиеДокумента()
	
	Если ТолькоПросмотр Или Объект.РазрешитьРедактированиеУведомления Тогда
		Возврат;	
	КонецЕсли;
	
	КонтролирующийОрган      = Перечисления.ТипыКонтролирующихОрганов.ФНС;
	СтатусОтправки           = Неопределено;
	СостояниеСдачиОтчетности = Неопределено;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОпределитьСтатусИСостояниеСдачиОтчетности(
		Объект.Уведомление, Объект.Организация, КонтролирующийОрган, СостояниеСдачиОтчетности, СтатусОтправки);
	
	Если СостояниеСдачиОтчетности <> Перечисления.СостояниеСдачиОтчетности.ДокументооборотНеНачат Тогда
	
		ТолькоПросмотр = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРазрешитьРедактированиеУведомления",
			"Видимость", Истина);		
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ИнициализироватьРеквизитыОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРеквизитыОрганизации()
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Организация,
		"КПП,КодОКТМО,ГоловнаяОрганизация");
	
	КППОрганизации 		= РеквизитыОрганизации.КПП;
	КодПоОКТМО 			= РеквизитыОрганизации.КодОКТМО;
	ГоловнаяОрганизация	= РеквизитыОрганизации.ГоловнаяОрганизация;
	
	Если Не ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		ГоловнаяОрганизация = Объект.Организация;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеСтрокиНалогиПриИзмененииВидНалогаИлиПлатежа(Знач ДанныеСтроки)

	Результат = Новый Структура;
	Если Не ЗначениеЗаполнено(ДанныеСтроки.ВидНалогаИлиПлатежа) Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Результат.Вставить("КодБК", Справочники.ВидыНалоговИПлатежей.КБКВидаНалога(ДанныеСтроки.ВидНалогаИлиПлатежа));
	ДанныеСтроки.Вставить("КодБК", Результат.КодБК);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Результат, ДанныеСтрокиНалогиПриИзмененииКодБК(ДанныеСтроки),
		Истина);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДанныеСтрокиНалогиПриИзмененииКодБК(Знач ДанныеСтроки)

	Результат = Новый Структура;
	Результат.Вставить("ПредставлениеКБК", ПредставлениеКБКНалога(ДанныеСтроки.КодБК));
	
	ПериодОтчета = ПериодОтчетаПоДатеУведомления(ДанныеСтроки.КодБК, ДанныеСтроки.Дата);
	Если Не ПериодичностьНеИзменилась(ДанныеСтроки, ПериодОтчета) Тогда
		Результат.Вставить("НачалоПериода", ПериодОтчета.НачалоПериода);
		Результат.Вставить("КонецПериода",  ПериодОтчета.КонецПериода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПериодичностьНеИзменилась(ПериодОтчета, НовыйПериодОтчета)
	Возврат
		ЗначениеЗаполнено(ПериодОтчета.НачалоПериода)
		И ЗначениеЗаполнено(НовыйПериодОтчета.НачалоПериода)
		И ((ЭтоПериодНДФЛ(ПериодОтчета) И ЭтоПериодНДФЛ(НовыйПериодОтчета))
		Или (ЭтоПериодМесяц(ПериодОтчета) И ЭтоПериодМесяц(НовыйПериодОтчета))
		Или (ЭтоПериодКвартал(ПериодОтчета) И ЭтоПериодКвартал(НовыйПериодОтчета)));
КонецФункции

&НаСервере
Функция ЭтоПериодНДФЛ(ПериодОтчета)
	Возврат	
		НачалоМесяца(ПериодОтчета.НачалоПериода) <> ПериодОтчета.НачалоПериода
		Или КонецМесяца(ПериодОтчета.КонецПериода) <> КонецДня(ПериодОтчета.КонецПериода);
КонецФункции

&НаСервере
Функция ЭтоПериодМесяц(ПериодОтчета)
	Возврат
		НачалоМесяца(ПериодОтчета.НачалоПериода) = ПериодОтчета.НачалоПериода
		И КонецМесяца(ПериодОтчета.НачалоПериода) = КонецДня(ПериодОтчета.КонецПериода);
КонецФункции

&НаСервере
Функция ЭтоПериодКвартал(ПериодОтчета)
	Возврат
		НачалоКвартала(ПериодОтчета.НачалоПериода) = ПериодОтчета.НачалоПериода
		И КонецКвартала(ПериодОтчета.НачалоПериода) = КонецДня(ПериодОтчета.КонецПериода);
КонецФункции

&НаСервере
Функция ПериодОтчетаПоДатеУведомления(Знач КодБК, Знач ДатаДокумента)

	Если КБКНалоговНДФЛ.Найти(КодБК) <> Неопределено Тогда
		ПериодОтчета = ПериодОтчетаНДФЛПоДатеУведомления(ДатаДокумента);	
	ИначеЕсли КБКНалоговУплачиваемыхЕжемесячно.Найти(КодБК) <> Неопределено Тогда 	
		ПериодОтчета = ПериодОтчетаЕжемесячныйПоДатеУведомления(ДатаДокумента);	
	ИначеЕсли КБКНалоговУплачиваемыхПоквартально.Найти(КодБК) <> Неопределено Тогда 	
		ПериодОтчета = ПериодОтчетаПоквартальныйПоДатеУведомления(ДатаДокумента);	
	Иначе	
		ПериодОтчета = Новый Структура;
		ПериодОтчета.Вставить("НачалоПериода", Дата(1,1,1));
		ПериодОтчета.Вставить("КонецПериода", Дата(1,1,1));
	КонецЕсли;
	
	Возврат ПериодОтчета;
	
КонецФункции

&НаСервере
Функция ПериодОтчетаНДФЛПоДатеУведомления(Знач ДатаДокумента)
	
	ПериодОтчета = Новый Структура;
	ПериодОтчета.Вставить("НачалоПериода", Дата(1,1,1));
	ПериодОтчета.Вставить("КонецПериода", Дата(1,1,1));

	ДатаДокумента = НачалоДня(ДатаДокумента);
	
	СрокПредоставления1 = Дата(Год(ДатаДокумента), Месяц(ДатаДокумента), 3);
	УточненныйСрокПредоставления1 = УточненныйСрокСУчетомВыходногоДня(СрокПредоставления1);
	
	СрокПредоставления2 = Дата(Год(ДатаДокумента), Месяц(ДатаДокумента), 25);
	УточненныйСрокПредоставления2 = УточненныйСрокСУчетомВыходногоДня(СрокПредоставления2);
	
	Если УточненныйСрокПредоставления1 >= ДатаДокумента
		И Не НачалоГода(ДатаДокумента) = НачалоМесяца(ДатаДокумента) Тогда
		
		ПериодОтчета.НачалоПериода = Дата(
			Год(ДатаДокумента),
			Месяц(ДобавитьМесяц(ДатаДокумента, -1)),
			23);
		ПериодОтчета.КонецПериода  = КонецМесяца(ПериодОтчета.НачалоПериода);
		
	ИначеЕсли УточненныйСрокПредоставления2 >= ДатаДокумента Тогда
		
		ПериодОтчета.КонецПериода = Дата(
			Год(ДатаДокумента),
			Месяц(ДатаДокумента),
			22);
		ПериодОтчета.НачалоПериода  = НачалоМесяца(ПериодОтчета.КонецПериода);
		
	Иначе
		
		ПериодОтчета.НачалоПериода = Дата(
			Год(ДатаДокумента),
			Месяц(ДатаДокумента),
			23);
		ПериодОтчета.КонецПериода = КонецМесяца(ПериодОтчета.НачалоПериода);
		
	КонецЕсли;
	
	Возврат ПериодОтчета;
	
КонецФункции

&НаСервере
Функция ПериодОтчетаЕжемесячныйПоДатеУведомления(Знач ДатаДокумента)
	
	ПериодОтчета = Новый Структура;
	ПериодОтчета.Вставить("НачалоПериода", Дата(1,1,1));
	ПериодОтчета.Вставить("КонецПериода", Дата(1,1,1));

	ДатаДокумента = НачалоДня(ДатаДокумента);
	
	СрокПредоставления = Дата(Год(ДатаДокумента), Месяц(ДатаДокумента), 25);
	УточненныйСрокПредоставления = УточненныйСрокСУчетомВыходногоДня(СрокПредоставления);
	Если УточненныйСрокПредоставления >= ДатаДокумента Тогда
		ПериодОтчета.НачалоПериода = НачалоМесяца(ДобавитьМесяц(УточненныйСрокПредоставления, -1));
	Иначе
		ПериодОтчета.НачалоПериода = НачалоМесяца(УточненныйСрокПредоставления);
	КонецЕсли;
	ПериодОтчета.КонецПериода = КонецМесяца(ПериодОтчета.НачалоПериода);
	
	Возврат ПериодОтчета;
	
КонецФункции

&НаСервере
Функция ПериодОтчетаПоквартальныйПоДатеУведомления(Знач ДатаДокумента)
	
	ПериодОтчета = Новый Структура;
	ПериодОтчета.Вставить("НачалоПериода", Дата(1,1,1));
	ПериодОтчета.Вставить("КонецПериода", Дата(1,1,1));
	
	ДатаДокумента = НачалоДня(ДатаДокумента);
	
	СрокПредоставления = НачалоКвартала(ДатаДокумента);
	СрокПредоставления = ДобавитьМесяц(СрокПредоставления, 
		?(СрокПредоставления = НачалоГода(СрокПредоставления), 1, 0));
	СрокПредоставления = Дата(Год(СрокПредоставления), Месяц(СрокПредоставления), 25);
		
	УточненныйСрокПредоставления = УточненныйСрокСУчетомВыходногоДня(СрокПредоставления);
	Если УточненныйСрокПредоставления >= ДатаДокумента Тогда
		ПериодОтчета.НачалоПериода = НачалоКвартала(ДобавитьМесяц(УточненныйСрокПредоставления, -3));
	Иначе
		ПериодОтчета.НачалоПериода = НачалоКвартала(УточненныйСрокПредоставления);
	КонецЕсли;
	ПериодОтчета.КонецПериода = КонецКвартала(ПериодОтчета.НачалоПериода);
	
	Возврат ПериодОтчета;
	
КонецФункции

&НаСервере
Функция УточненныйСрокСУчетомВыходногоДня(Знач СрокИсходный, ПолучатьПредшествующие = Ложь)
	
	УточненныйСрок = СрокИсходный;
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	
	ПараметрыПолученияБлижайшихРабочихДат = КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат(ПроизводственныйКалендарь);
	Если ПолучатьПредшествующие Тогда
		ПараметрыПолученияБлижайшихРабочихДат.ПолучатьПредшествующие = Истина;
	КонецЕсли;
	
	ГрафикПереноса = КалендарныеГрафики.БлижайшиеРабочиеДаты(
		ПроизводственныйКалендарь,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СрокИсходный),
		ПараметрыПолученияБлижайшихРабочихДат);
		
	НовыйСрок = ГрафикПереноса[СрокИсходный];
	Если ЗначениеЗаполнено(НовыйСрок) Тогда
		УточненныйСрок = НовыйСрок;
	КонецЕсли;

	Возврат УточненныйСрок;
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеСтрокиНалогиПриИзмененииНалогСборПлатеж(Знач ДанныеСтроки)

	Результат = Новый Структура;
	Если Не ЗначениеЗаполнено(ДанныеСтроки.НалогСборПлатеж) Тогда
		Возврат Результат;	
	КонецЕсли;
	
	КодПоОКТМО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.НалогСборПлатеж, "КодОКТМО");
	Если ЗначениеЗаполнено(КодПоОКТМО) Тогда
		Результат.Вставить("КодПоОКТМО", КодПоОКТМО);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблицы()
	
	Для каждого СтрокаТаблицы Из Объект.Налоги Цикл
		ЗаполнитьДобавленныеКолонкиСтрокиТаблицы(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиСтрокиТаблицы(СтрокаТаблицы)
	
	СтрокаТаблицы.ПредставлениеПериода =
		ПредставлениеПериодаОтчета(СтрокаТаблицы.НачалоПериода, СтрокаТаблицы.КонецПериода);
		
	СтрокаТаблицы.ПредставлениеКБК = ПредставлениеКБКНалога(СтрокаТаблицы.КодБК);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСтандартногоПериодаЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Налоги.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные.НачалоПериода = РезультатВыбора.НачалоПериода;
	ТекущиеДанные.КонецПериода  = РезультатВыбора.КонецПериода;
		
	Если КБКНалоговНДФЛ.Найти(ТекущиеДанные.КодБК) <> Неопределено Тогда
		
		СписокУточненияПериода = Новый СписокЗначений;
		
		НачалоПериода = Дата(Год(ТекущиеДанные.НачалоПериода), Месяц(ТекущиеДанные.НачалоПериода), 23);
		КонецПериода  = Дата(Год(ТекущиеДанные.КонецПериода), Месяц(ТекущиеДанные.КонецПериода), День(ТекущиеДанные.КонецПериода));
		
		НазваниеМесяца = Месяцы()[Месяц(НачалоПериода) - 1];
		
		НачалоОтчетногоМесяца = СтрШаблон(НСтр("ru = 'Начало %1: до %2'"),
			НазваниеМесяца, Формат(НачалоПериода, "ДФ=dd.MM.yyyy"));
			
		КонецОтчетногоМесяца  = СтрШаблон(НСтр("ru = 'Конец %1: %2'"),
			НазваниеМесяца, Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " - " + Формат(КонецПериода, "ДФ=dd.MM.yyyy"));
		
		СписокУточненияПериода.Добавить(1, НачалоОтчетногоМесяца);
		СписокУточненияПериода.Добавить(2, КонецОтчетногоМесяца);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("УточнениеПериодаЗавершение", ЭтотОбъект);
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокУточненияПериода, "НалогиПредставлениеПериода");
		
	Иначе
		ТекущиеДанные.ПредставлениеПериода =
			ПредставлениеПериодаОтчета(ТекущиеДанные.НачалоПериода, ТекущиеДанные.КонецПериода);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УточнениеПериодаЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = Элементы.Налоги.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонецОтчетногоМесяца = Ложь;
	
	Если РезультатВыбора <> Неопределено Тогда
		КонецОтчетногоМесяца = РезультатВыбора.Значение = 2;
	КонецЕсли;
	
	Если КонецОтчетногоМесяца Тогда
		ТекущиеДанные.НачалоПериода = Дата(Год(ТекущиеДанные.НачалоПериода), Месяц(ТекущиеДанные.НачалоПериода), 23);
		ТекущиеДанные.КонецПериода  = Дата(Год(ТекущиеДанные.КонецПериода), Месяц(ТекущиеДанные.КонецПериода), День(ТекущиеДанные.КонецПериода));
	Иначе
		ТекущиеДанные.НачалоПериода = Дата(Год(ТекущиеДанные.НачалоПериода), Месяц(ТекущиеДанные.НачалоПериода), День(ТекущиеДанные.НачалоПериода));
		ТекущиеДанные.КонецПериода  = Дата(Год(ТекущиеДанные.КонецПериода), Месяц(ТекущиеДанные.КонецПериода), 22);
	КонецЕсли;
	
	ТекущиеДанные.ПредставлениеПериода =
			ПредставлениеПериодаОтчета(ТекущиеДанные.НачалоПериода, ТекущиеДанные.КонецПериода);
			
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеПериодаОтчета(НачалоПериода, КонецПериода)

	Возврат ЕдиныйНалоговыйСчетКлиентСервер.ПредставлениеПериодаОтчета(НачалоПериода, КонецПериода);
	
КонецФункции

&НаСервере
Функция ПредставлениеКБКНалога(КодБК)
	
	ПредставлениеКБКНалога = "";
	НашлиПредставление = ПредставленияКБК.НайтиСтроки(Новый Структура("КодБК", КодБК));
	Если НашлиПредставление.Количество() > 0 Тогда
		ПредставлениеКБКНалога = НашлиПредставление[0].ПредставлениеКБК;
	КонецЕсли;
	
	Возврат ПредставлениеКБКНалога;

КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПодбора()
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
	ПараметрыОткрытияФормы.Вставить("Организация", 				Объект.Организация);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДополнитьТаблицуНалогов", ЭтотОбъект);
	
	ОткрытьФорму("Документ.УведомлениеОбИсчисленныхСуммахНалогов.Форма.ФормаПодбора", ПараметрыОткрытияФормы, , , , ,
		ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
&НаКлиенте
Процедура ДополнитьТаблицуНалогов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия = "ПеренестиВДокумент" Тогда
		
		ДополнитьТаблицуНалоговНаСервере();
		Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДополнитьТаблицуНалоговНаСервере()
	
	ТаблицаНалоги = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	ПоляПоиска = "КПП,КодПоОКТМО,КодБК,НачалоПериода,КонецПериода";
	ПараметрыПоиска = Новый Структура(ПоляПоиска);
	
	Для каждого СтрокаНалоги Из ТаблицаНалоги Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаНалоги);
		НашлиСтроки = Объект.Налоги.НайтиСтроки(ПараметрыПоиска);
		Если НашлиСтроки.Количество() > 0 Тогда
			НоваяСтрока = НашлиСтроки[0];
		Иначе
			НоваяСтрока = Объект.Налоги.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНалоги);
		ЗаполнитьДобавленныеКолонкиСтрокиТаблицы(НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры 

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция КППНалоговогоОргана(Знач НалоговыйОрган)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НалоговыйОрган, "КПП");

КонецФункции

&НаКлиенте
Функция Месяцы()
	Если Месяцы = Неопределено Тогда
		Месяцы = Новый Массив;
		Месяцы.Добавить("января");
		Месяцы.Добавить("февраля");
		Месяцы.Добавить("марта");
		Месяцы.Добавить("апреля");
		Месяцы.Добавить("мая");
		Месяцы.Добавить("июня");
		Месяцы.Добавить("июля");
		Месяцы.Добавить("августа");
		Месяцы.Добавить("сентября");
		Месяцы.Добавить("октября");
		Месяцы.Добавить("ноября");
		Месяцы.Добавить("декабря");
	КонецЕсли;
	Возврат Месяцы;
КонецФункции

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
